sdfIbmESISphereLaminar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sdfIbmESI;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2400;

deltaT          0.05;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.1;

//functions
//{
//centerline // the name for the probe
//{
//// Type of functionObject
//type probes;
//
//// Where to load it from (if not already in solver)
//functionObjectLibs ("libsampling.so");
//
//// Locations to be probed. runTime modifiable!
//probeLocations
//(
//(-0.15 0 0) // first point to probe inside the geometry
//(0.15 0 0) // second point to probe inside the geometry
//);
//
//// Fields to be probed. runTime modifiable!
//fields
//(
//taufirst // create probe data to taufirst field (symmTensor)
//U // create probe data to U field (vector)
//p // create probe data to p field (scalar)
//// .... another field we want
//);
//}
//}
// ************************************************************************* //
